<?php
$words=array(
	3=>array(0=>"web前端1",
			 1=>"web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1web前端介绍1"),
	4=>array(0=>"web前端2",
			 1=>"web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2web前端介绍2"),
	5=>array(0=>"web前端3",
			 1=>"web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3web前端介绍3"),
	6=>array(0=>"网页前端1",
			 1=>"网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍网页前端1介绍"),
	7=>array(0=>"网页前端2",
			 1=>"网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍"),
	8=>array(0=>"网页前端5",
			 1=>"网页前端5介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍"),
	9=>array(0=>"网页前端",
			 1=>"网页前端介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍"),
	10=>array(0=>"web前端",
			 1=>"web前端介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍"),
	1=>array(0=>"web",
			 1=>"web介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍"),
	0=>array(0=>"前端",
			 1=>"web介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍"),
	2=>array(0=>"网页",
			 1=>"web介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍网页前端2介绍")
);
$input=$_GET['input'];
// $input="网页";
$res = array();

for ($i=0; $i<count($words); $i++) { 
	if (stripos($words[$i][0], $input)!==false) {
		$res[]=$words[$i];
	}
}

echo json_encode($res);
?>